[Italian]
Please connect the 2.4GHz USB dongle of the device to your computer's USB port for pairing. = Collegare il dongle USB a 2,4 GHz del dispositivo alla porta USB del computer per l’associazione.
Please follow the steps below for pairing. = Attenersi alle procedure di seguito per l’associazione.
1. Set the connection switch to the RF 2.4GHz mode. = 1. Impostare l’interruttore di connessione in Modalità RF 2,4 GHz.
2. Press and hold the left button, right button and DPI button for 3 seconds. = 2. Tenere premuto il tasto di sinistro, il tasto destro e il tasto DPI per 3 secondi.
3. Click the "Pair" button on the interface. = 3. Fare clic sul tasto “Associa” sull’interfaccia.	
1. Connect the device to your computer with the USB cable. = 1. Collegare il, dispositivo al computer con il cavo USB.
2. Click the "Pair" button on the interface. = 2. Fare clic sul tasto “Associa” sull’interfaccia.

Pair = Associa
Close = Chiudi
Pairing = Associazione
Pairing completed = Associazione completata
Pairing failed = Associazione non riuscita

1. Connect the headset with a USB cable and switch to 2.4GHz mode. = 1. Collegare il dispositivo al computer con un cavo USB e impostare l'interruttore di connessione sulla modalità RF 2,4 GHz.
2. Press and hold the function button for 15 seconds until you hear the beep sounds. = 2. Tenere premuto il tasto funzione per 15 secondi finché non si sentono messaggi acustici.
Please unplug and re-plug the 2.4 GHz receiver(dongle), power off the headset and then switch it to RF 2.4 GHz mode. = Scollegare e reinserire il ricevitore RF 2,4 GHz. Spegnere il dispositivo, quindi portare il dispositivo sulla modalità RF 2,4 GHz.